Revit 2027 API
RoofComponents Properties
The RoofComponents type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ScaledDepth |  The depth of the roof slab.
Top
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace